spec/cassettes/Credit_Card_Authorization_Process.yml

---
http_interactions:
- request:
    method: post
    uri: https://<ADYEN_API_USERNAME>:<ADYEN_API_PASSWORD>@pal-test.adyen.com/pal/adapter/httppost
    body:
      encoding: US-ASCII
      string: paymentRequest.reference=R972204915&paymentRequest.merchantAccount=<ADYEN_MERCHANT_ACCOUNT>&paymentRequest.amount.value=2000&paymentRequest.amount.currency=USD&paymentRequest.shopperIP=&paymentRequest.shopperEmail=spree%40example.com&paymentRequest.shopperReference=1&paymentRequest.billingAddress.street=10+Lovely+Street&paymentRequest.billingAddress.houseNumberOrName=NA&paymentRequest.billingAddress.city=Herndon&paymentRequest.billingAddress.postalCode=26206&paymentRequest.billingAddress.stateOrProvince=AL&paymentRequest.billingAddress.country=US&paymentRequest.additionalData.card.encrypted.json=adyenjs_0_1_18%24DgN%2FkoPYZnJx0CdlRdsldan4aUmyVPCq7p9HVMOObGzCrIjhKKSp%2BLHiytqv3vMeqnVV1vmVZfJsvkvAXiQiak9pva90UY8eE7OI8ZRdjT4PxRWwje%2FhZ11Onkb0S06XJ%2Bbhqi8oDJ7weqU1grpruhoNDCxI2hJrkzGGcPTefkSUSLbxW3yrLW3FvPTu%2F7O3%2Fu6DkU1QwgCyljZbgALYNnh5UNKD1N80eDkgNrJZEvBfv%2FEcykvs%2B7IojAtjcIyFrz6G2THCcc6APhJDIh%2BbFCwttu9t7YzOn5UvowyBOXuCNyvrPPe2KF08fojL%2FID8ijQiomPPuLXDuUZR1XxX6g%3D%3D%24nPlktP%2FaQMGUwXUQ2NF5nKglnnQhrUEMEcpXe%2FHFIDMLEkwdpxJarMKRBzMpPkqOiP%2BGWedLfRb2QwduqB%2F8aW3J9drxAyYkx2WfjYtzdbCAg%2BLz%2BhzS8tNJNB5yRTnSlAH6hHSwv%2Bsdrgbo5v2TLnzdr%2B4uDg4LgEu8fUT2KwDzS8Edmc7Atqj%2FByrklggurmkcuDbblRvfMnuaJOXHnwHleIcEG%2BUSORcb2hnWOb%2FHC%2BpqR4Rtm2RYBdFlLHAoQGZEpqf4prbqUQZk9LDan2a2cVbO9UWcbgBf1hFUFgUpF8N%2F%2B7Ih4mpymK46YyczT0Fws%2F36QXpPC2iawiwcJjRld2N7K7l81X4cK0cfWK3rOWOqcYG4K7ihXPxu6AS%2F9%2BJ%2FO%2BE2pTeUvA%2FunSbyUv%2FMaziAIR6zgv1EBeHC7SDu5m8Iu3Qp1vu%2FDmuBRQmsKUA9cUMtifSygOoNDmJZGemc5VK%2Fr1%2BMTiFbgPaeo%2FCJPIotL17OGq1WxgprFEImaMZGCSKH60BB1nmAWs8mmSWUoqkvTwFn4182yve%2BFiFVAzV4PEa2mfsWfyzKc19vGkUa3pXVxyd8b1r1xdHFsVsDPfbfNHr3Rco2OhtBMUoKBdlczik4bjb2Cjp5b%2F5q5f55e8V6Fjrb3oeofXYh9Kq1CyCc5ctApa8Pu7Aja3OpGc1wCncQx3vCs7g2UJzEbh8Vkond2eSiv%2BAgv929loxbOWrDvU%2FboWaVg2hbbTA%2F1%2FzZgP2zEeHdoc1sdkZxQNjwnSMRA0bQ%2Be4upyxo6I84537TK4QLVe1pPn8HDwOxBzMW%2Fv7UpqsWr%2BNGixRmEQlS0igfPzCU79gFO0nxy77RoHc89n7MzEpfkhJRso9Vun5SRCE44P93ibOvC1ChhyLEO6aFlFLgUnuCNgSuD4sjiAQIGvD3E0fGpq5TjXd5583MSrEHFjKGJOAglrhO%2B7MQbDs9TA51HEhwpKnWracY%2FPoeH52C5CQSmHAY0BbYHyRGsoilFFGSf%2Bvjgy4ax1pzPmzhtceBcg%2Bd%2FaXgWcm1cIekcojcBvU2khAAYX5NB%2BGKDK2y4qweTOJ5IInxxURO7UXQRkM%2BoSVuDgtWpJyvjqwVqIu3L0dJC92tHPPmkUJEuKomBEsj7r%2Fpn7j8ibjXUpsDjQgq3xURsgQ4rCeRmBMi0%2FL%2BQH%2FodOmps55CNcMw8hQkSbFGNC6FwZWWrijsKerpLvbdf5p6Qat5vGrkMgM%2BsJUar7SH2E%2Fhr0MIyRnaa0hMF%2FgSkAkgVppLqeYzGB2S07WQJErqZHVzj6XjyoGmW1u3g6koXWVGM%2FG3Klq3SmmuX3IDggP8CfOhMwVVPFMDNMvLD%2FkeCh6nOdP5OZxUAPDPwXfbLY0jj0AB4y6fYsz2hGsQTcBVTp09CJ0NpPE0%2Bv40vA91un9lGpOFeS4NZyrRA2A8PpZfEnlVnPEpaeGPRZ1xBGFmVSV23Oq4jc82Gw3Fi03eVc8xT6iMlwNnFDufxvQ2qi7cNFdEC%2FjZxv5e2B1%2BXBG%2Fk1s0h3sMGU9UzS3f%2Bqh0OyzWsCaMi1EbcTiU19on0MMEr9WwCoAPviZpHH6e8obmq%2BTG1g6TFAqNEIBCWuclYgz30PPaiiFS4hRWgpZ%2BTy8F6rxR1loRu%2FNYfu48Aate89QPPEYWX4RfeFb2JgoiwemfjU1vtVV%2BhMTox2d3kGq2McDBrpu7uK%2F6nhgY%2Bgv2jpo4Zy6vkHR5blUld%2BLohGBi0oiYBGXJr%2F71v%2BgklvX7sBXMbHK0gJdGOssYBvPS%2B84eTy0kfQ4uUCDj0ekpsOKQ3ubVWgfj4vq0NnUebKNrWJP3%2Fn%2FXylPhZR7eqFaUvE0C8lpXDGdW2du2wbai965obHHdlX9dtIRSbjn7LHn6MiedvLNHtccuPO8%2FkV1XDOEfB16EBHgdlB3su4R5YxCHHxFhkM%2F71bWBKqocmDmVQjeen2ppywocM1DYnrfmkJjfd7IoT%2BI5LfjlZPgqPOCvJWQzb6naIKd4VBZRnXqMK0%2FXDrD4L1zwj3OUZjGHcWR%2BJ5gdhJSvqtZp4Jsvn%2B2i5PsAXUhtyDBEKLqaZQSmielXlFS5UIf22CqZ8JPMKUOXnC0vioPIoCW%2F7YlUAk9d3Ksb7LcRCBwgc9fct44LNUvljEFJ%2FL1qpJhQuDecC%2FbLFxBahPCvQ9TfbtXOE%2BaTfD57GGAP5AAHmkD2dWTG66sDzwhMgwncJtSMR3bI81IsjRFOjMcA4SirfK3iecbqw1qD1RwhSdAnHl9y4HFhHFev1XfP3hlBAE9bROW25tYqI6SqHibly548fCwlTrw8X9T1heOmIHMpL7FNbP%2FW4axvsCD4vTWdSvkP34oQvIkGDlzfHu6amfM0%2BiG6U1byV8tzXo6%2FZBeyazM%2B3Qa159IJTYLp8kX9EaJZ8Sj2h3wr7Du81P6Iy%2FUavBoq%2BVOLEWrL997DzIZLbJjZb%2BzspYmBWxhLNG%2FENtSD000bvkAZixkUQiFfOI1IQf8JoXb6d1LYaMo0L4KH8I3lt%2FmNcZeNyE6Pcj%2BtRatoRLhbgB%2BC%2BjxpPRlq7ZZU6mX1CecTzUcR0DMT51ed4cPySH94R2FVE%2F3XW0uem91c1P9zeVQC%2BFDFtY723P9YsnFPIywo52EE%2B9Jt1I5Jh8sJbPoGWEQRDRxn3D2EE82MUaNzVokoDj621YoxmHE%3D&paymentRequest.browserInfo.userAgent=Mozilla%2F5.0+%28Unknown%3B+Linux+x86_64%29+AppleWebKit%2F538.1+%28KHTML%2C+like+Gecko%29+PhantomJS%2F2.1.1+Safari%2F538.1&paymentRequest.browserInfo.acceptHeader=text%2Fhtml%2Capplication%2Fxhtml%2Bxml%2Capplication%2Fxml%3Bq%3D0.9%2C*%2F*%3Bq%3D0.8&paymentRequest.recurring.contract=RECURRING&action=Payment.authorise
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 08 Aug 2017 23:28:50 GMT
      Server:
      - Apache
      Set-Cookie:
      - JSESSIONID=1CFACF1CC3AD58F8030E07B9EE7A298E.test103e; Path=/pal; Secure; HttpOnly
      Content-Length:
      - '108'
      Content-Type:
      - application/x-www-form-urlencoded
    body:
      encoding: UTF-8
      string: paymentResult.resultCode=Authorised&paymentResult.pspReference=8835022349302033&paymentResult.authCode=66168
    http_version: 
  recorded_at: Tue, 08 Aug 2017 23:28:50 GMT
- request:
    method: post
    uri: https://<ADYEN_API_USERNAME>:<ADYEN_API_PASSWORD>@pal-test.adyen.com/pal/adapter/httppost
    body:
      encoding: US-ASCII
      string: recurringDetailsRequest.merchantAccount=<ADYEN_MERCHANT_ACCOUNT>&recurringDetailsRequest.shopperReference=1&recurringDetailsRequest.recurring.contract=RECURRING&action=Recurring.listRecurringDetails
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 08 Aug 2017 23:28:51 GMT
      Server:
      - Apache
      Set-Cookie:
      - JSESSIONID=1D1262E8978657C7993185AC52A7171F.test104e; Path=/pal; Secure; HttpOnly
      Content-Length:
      - '1712'
      Content-Type:
      - application/x-www-form-urlencoded
    body:
      encoding: UTF-8
      string: recurringDetailsResult.details.0.card.billingAddress.stateOrProvince=AL&recurringDetailsResult.details.0.variant=discover&recurringDetailsResult.details.0.card.billingAddress.houseNumberOrName=NA&recurringDetailsResult.details.0.card.holderName=John+Doe&recurringDetailsResult.details.0.aliasType=Default&recurringDetailsResult.details.0.firstPspReference=8835022349302033&recurringDetailsResult.details.0.alias=M512442788467272&recurringDetailsResult.details.0.card.expiryMonth=8&recurringDetailsResult.details.0.billingAddress.stateOrProvince=AL&recurringDetailsResult.details.0.billingAddress.street=10+Lovely+Street&recurringDetailsResult.details.0.card.billingAddress.postalCode=26206&recurringDetailsResult.details.0.card.number=6611&recurringDetailsResult.details.0.billingAddress.country=US&recurringDetailsResult.details.0.billingAddress.houseNumberOrName=NA&recurringDetailsResult.creationDate=2016-08-12T13%3A47%3A25%2B02%3A00&recurringDetailsResult.shopperReference=1&recurringDetailsResult.details.0.card.expiryYear=2018&recurringDetailsResult.details.0.paymentMethodVariant=discover&recurringDetailsResult.details.0.additionalData.cardBin=601160&recurringDetailsResult.details.0.billingAddress.postalCode=26206&recurringDetailsResult.details.0.card.billingAddress.city=Herndon&recurringDetailsResult.details.0.card.billingAddress.country=US&recurringDetailsResult.details.0.card.billingAddress.street=10+Lovely+Street&recurringDetailsResult.details.0.creationDate=2017-08-09T01%3A28%3A50%2B02%3A00&recurringDetailsResult.details.0.billingAddress.city=Herndon&recurringDetailsResult.details.0.recurringDetailReference=8414725049542679&recurringDetailsResult.lastKnownShopperEmail=spree%40example.com
    http_version: 
  recorded_at: Tue, 08 Aug 2017 23:28:51 GMT
recorded_with: VCR 3.0.3
