spec/cassettes/Credit_Card_Purchase_Process.yml

---
http_interactions:
- request:
    method: post
    uri: https://<ADYEN_API_USERNAME>:<ADYEN_API_PASSWORD>@pal-test.adyen.com/pal/adapter/httppost
    body:
      encoding: US-ASCII
      string: paymentRequest.reference=R093790928&paymentRequest.merchantAccount=<ADYEN_MERCHANT_ACCOUNT>&paymentRequest.amount.value=2000&paymentRequest.amount.currency=USD&paymentRequest.shopperIP=&paymentRequest.shopperEmail=spree%40example.com&paymentRequest.shopperReference=1&paymentRequest.billingAddress.street=10+Lovely+Street&paymentRequest.billingAddress.houseNumberOrName=NA&paymentRequest.billingAddress.city=Herndon&paymentRequest.billingAddress.postalCode=54370-6198&paymentRequest.billingAddress.stateOrProvince=AL&paymentRequest.billingAddress.country=US&paymentRequest.additionalData.card.encrypted.json=adyenjs_0_1_18%24zcUKCMThEl3QD590bnASVyL9znF96YsvyV1ZuhdhRmjxJMDqkcmNBPGd7fn0rgV%2Fu8dE5L%2BYDSbZRM%2Br1e0fhFBId3xAPCHImcTVYBp8Qkbaujy5jyzibLjHrwgAqMe0rg52XY31X88DjJjpDx91jvVw8u9tofX0%2BzEnubxFiF70MVGey1inIh3X6qKH%2FGlI4L1LFfscR5aq455YxOP%2B9I6jjtu8H%2FaZgRM%2FcOLme6DGhOx6tJ1x4yb285RgaPztZjMZPjH6U1k8WLP4ICNizDVu4UGTUMcuAEINOELfSo9mWO9TmFpDv407sGYS%2Bzi19Rl7DvpR87l1JIg07wnlDA%3D%3D%24q9pajGcOrrT7%2Bvf8G76Hd8Kkpyc0oT9HXH5qnoOhkWe2l4s%2BBLVqKQDcv5PgCUVfjQp%2F98B%2B6yWhZTcC3On4L0sJeYBlnGPSY0RSOjvFpKXqo7bA7wf8bsqz%2BQ6JQbPYm0bvuo5vJ4SR78QhL%2BVUuxtgLN2qw5XLfOv3HRIqlBoFekHF3DKWbstpoWn4FjHeQMFO5QbedqxFTViBgdQIYne0XWGwxt83upu1yRfeMCb5HQDrbnnIAJLsRZy3HAYrGp2dudveexc7Ba9TKvByW2IBTYSg7MR7XRPHZ1%2BRAvpq6kRPF8WfMB5OchZOU06f8n74OOh3JzD3W7ul9ZA9XSArlPI90PLH8On7mXCcp4lyfpgIbSjtt%2FTw71qEVGzb38E2d2QhQvYxOr%2BEdWadsuK3olUJCGcFJRZhuVE3qZe%2FFqA1BvQXXRsEB10lkHChbyIPfjL9tEthuujs0SFvviCl1dYcxnXI4GTK1PLU7k5B%2FE9hvM0CeDHjq2ia6JOHIfoav8x3VKqv3D4sUTYbwUtVvyy8CErCefgTP84B%2BtXOcS3i4EiyR6MbbQm3Gg0b4mxq%2FHf2fSZyVvTZf2TgiE9yT6qV5rVhextX6se2vqu1tuFCB2gKFQgsrllkDu8lUq%2BzNDwLYpejz2Z3rqXhwhU41mBrG0qpi58g89UD%2B6gd4WF67HctMGLQww7iyE4EpEiXiFk7U%2BToWg5V032M1JlFe9c%2BmUmgMrj%2B4GIjqI%2F1IkKxmAvlJ8a33jTHHLoXYzpLdpdm%2BHIi2bDSBA2i1Qy4%2Fc9ahfirV8Jj5v8Pjeixc1pcv4cSzsnD9f024uNQR%2BxXcyLn%2F1P9D%2FQn6Vf3wecLfQxsTnH%2F3gdET7UbmWkkmhJBmWgQml5crGjAlCfipq55zVIgChsYdpbjzZIH0aH%2FPQ%2BjqMuSqxd%2B83xkpqbZIFr%2B89MmLWnbwPggadkE%2Fq9xbatNjXv5oUIFxmG7bneaBk4z6gkOD2lFvA%2F0tCuQhDWXA4ztdKatnRDzG1D%2Fs%2BL6ECIzPRHqgYWTbUPnz%2FgoKGo52THAbQMDHR2SGsRpcYk%2F5ClZlZ4XLjXHPkCVtwAFCFc76lFf1Fah8j44sa6LsMa2nsu%2B8xpMRjMZkKwzpQFzkftjKgtglzlyuCytB6lXL2AlkuNjTYrP1fOr6aNzENmqPH4eIJkHdiDUsMa5OVYcDaLZrerOMo5GCYwABkb9kJv%2F1bY2%2BLGRcNYIPhYMK93SopOE5uanFWuCW8aB5rMHqR6RVOOlqE5Em29k76TKu0qOfjQzJjqWsCegITG7TSR4hZ1NnKituHjfRbmgZv1KML%2BGUzCZVD1Yvm5dpNzDtYH3z6vX9X19F%2BLCg5%2BOeAnOAxilmKpjHaRLI8vkd9rZ2pGaQ%2FcYV%2Bu9bGJCb3i8wMFVNbZIpaHUxuoY75H8HkJMCGG2JJbpZUnwgdZr9ZANdaH5fVPE4RsMSRxnhlFrhtXdBLHWmFDv0j2BGZcgcHCIObty3b0lPRU73Oaaxlf66wYv1o5lGf2fEDyqdJkWouUCxxL0IFMfj4Lq6ln7Pl0mVnYk1AjCHb8%2F0OUCLNVNCx%2FIIkqJMsSJe%2BAAihKgoYMPs4MKKg3D9NAypy2pmgbobX2CSkAufnaN6nhj6vSrl0JZvaAUdzHxfEDchMWtc4C0sXApJCyKCG8D4d4KuS%2FmRcSp0P6ndcAqbCHu%2BouJX0x4H5hhZosh37nB0sCd5wgdvduxufRs%2BhrrxE7PAaiTZs3y%2FZg%2BkdBRleYz9Ue7V2jFZ3smFcEzlgOHuGvRE3N2Pu0Cxmxo3AyLvfhIfl8Fj4BSEM3kNV8NnYp%2B6%2FG7myT2fYNORTy2XgcjwHKb9EBpAQXueUpIhbvj6hrx7IaDbO9rTvKtDToegKd8I8HWDP0M7iaRhG3OdqaNzyRqjHusa3WM0HHCB7upDMtG5jUDnQok6zJUpbpKRPC3JiZOuFe%2B2%2BassbpnBNGQZ2oqRuJvaEIf5N4likCyyd%2BXHVEEmyr3IzoU7ANAzb6KBzqTsGhgih%2FhGX4XxS0jgjjgTFM%2BRT05%2Fi4ZcqgtALEonubLSj88T%2F01L7%2FJ7vLUDpHOvOngJAUnoVwjF2Cxe0nhRxWWXQLkd3JrbboYgfeCOpHSTnH%2Fx%2Fp5nhnFXmQ5YfYvi0KDN%2Bb3VNXewRZbYmyShMbz4dXvmtBL1GhxzC0wjtn2vgXUIJM5BrCWIhwsRnYnsMjAAK0DyVldnLLXUQuqsnyL97BEUoazaJUWEXhE58AFMThRqdQF5IXWOiOnqG5SWSI3C5PTicMSbIRimgXDNoKfLeQzBIZUdUpnwn4jfLKmyxRpPjLzP55yPGJSvEF03tGSjQG1aJoBllyZMASdEijKu854k8yN20Rj84HoXOOCrgruqAus3HM%2BhYYzvpGIRY%2FmX49kG49DLuXPXtucqaPcUw2bWTQv8PPQqjLz3X6WkXcBKx6Y%2BPEfrz36k7q1Zwu7kq5P6x9djh4Bz7m9ImFpiNng%2FrWltzeVGhCiI3hcOlZNeZzDklOXXwQvVaYnlzUzaNznMwYBHdmTjhqkBIYMEolPpKGsKNtEzSjHuGwgBY3WRzFh5dGZitJg9pTy6SLsKAjz1cr7nYXdQyNlTrMPPJlnhjxND3m4Dyz6Hu6f80YuZ9u975MoBhC%2Bm8IFzegxR6DcH1SrtMu7LxxK9Hr7bRo%3D&paymentRequest.browserInfo.userAgent=Mozilla%2F5.0+%28Unknown%3B+Linux+x86_64%29+AppleWebKit%2F538.1+%28KHTML%2C+like+Gecko%29+PhantomJS%2F2.1.1+Safari%2F538.1&paymentRequest.browserInfo.acceptHeader=text%2Fhtml%2Capplication%2Fxhtml%2Bxml%2Capplication%2Fxml%3Bq%3D0.9%2C*%2F*%3Bq%3D0.8&paymentRequest.recurring.contract=RECURRING&action=Payment.authorise
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 08 Aug 2017 23:28:54 GMT
      Server:
      - Apache
      Set-Cookie:
      - JSESSIONID=8966F4F239DD552F801AEC9E4A7D2EF3.test104e; Path=/pal; Secure; HttpOnly
      Content-Length:
      - '108'
      Content-Type:
      - application/x-www-form-urlencoded
    body:
      encoding: UTF-8
      string: paymentResult.resultCode=Authorised&paymentResult.pspReference=8815022349345739&paymentResult.authCode=11184
    http_version: 
  recorded_at: Tue, 08 Aug 2017 23:28:55 GMT
- request:
    method: post
    uri: https://<ADYEN_API_USERNAME>:<ADYEN_API_PASSWORD>@pal-test.adyen.com/pal/adapter/httppost
    body:
      encoding: US-ASCII
      string: recurringDetailsRequest.merchantAccount=<ADYEN_MERCHANT_ACCOUNT>&recurringDetailsRequest.shopperReference=1&recurringDetailsRequest.recurring.contract=RECURRING&action=Recurring.listRecurringDetails
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 08 Aug 2017 23:28:56 GMT
      Server:
      - Apache
      Set-Cookie:
      - JSESSIONID=48A8EBA9E3B1E2E311F9E701C40ED890.test103e; Path=/pal; Secure; HttpOnly
      Content-Length:
      - '1722'
      Content-Type:
      - application/x-www-form-urlencoded
    body:
      encoding: UTF-8
      string: recurringDetailsResult.details.0.card.billingAddress.stateOrProvince=AL&recurringDetailsResult.details.0.variant=discover&recurringDetailsResult.details.0.card.billingAddress.houseNumberOrName=NA&recurringDetailsResult.details.0.card.holderName=John+Doe&recurringDetailsResult.details.0.aliasType=Default&recurringDetailsResult.details.0.firstPspReference=8815022349345739&recurringDetailsResult.details.0.alias=M512442788467272&recurringDetailsResult.details.0.card.expiryMonth=8&recurringDetailsResult.details.0.billingAddress.stateOrProvince=AL&recurringDetailsResult.details.0.billingAddress.street=10+Lovely+Street&recurringDetailsResult.details.0.card.billingAddress.postalCode=54370-6198&recurringDetailsResult.details.0.card.number=6611&recurringDetailsResult.details.0.billingAddress.country=US&recurringDetailsResult.details.0.billingAddress.houseNumberOrName=NA&recurringDetailsResult.creationDate=2016-08-12T13%3A47%3A25%2B02%3A00&recurringDetailsResult.shopperReference=1&recurringDetailsResult.details.0.card.expiryYear=2018&recurringDetailsResult.details.0.paymentMethodVariant=discover&recurringDetailsResult.details.0.additionalData.cardBin=601160&recurringDetailsResult.details.0.billingAddress.postalCode=54370-6198&recurringDetailsResult.details.0.card.billingAddress.city=Herndon&recurringDetailsResult.details.0.card.billingAddress.country=US&recurringDetailsResult.details.0.card.billingAddress.street=10+Lovely+Street&recurringDetailsResult.details.0.creationDate=2017-08-09T01%3A28%3A55%2B02%3A00&recurringDetailsResult.details.0.billingAddress.city=Herndon&recurringDetailsResult.details.0.recurringDetailReference=8414725049542679&recurringDetailsResult.lastKnownShopperEmail=spree%40example.com
    http_version: 
  recorded_at: Tue, 08 Aug 2017 23:28:56 GMT
- request:
    method: post
    uri: https://<ADYEN_API_USERNAME>:<ADYEN_API_PASSWORD>@pal-test.adyen.com/pal/adapter/httppost
    body:
      encoding: US-ASCII
      string: modificationRequest.merchantAccount=<ADYEN_MERCHANT_ACCOUNT>&modificationRequest.modificationAmount.currency=USD&modificationRequest.modificationAmount.value=2000&modificationRequest.originalReference=8815022349345739&action=Payment.capture
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 08 Aug 2017 23:28:57 GMT
      Server:
      - Apache
      Set-Cookie:
      - JSESSIONID=5EF4E5F190367755A11A6C7CF1A8621C.test3e; Path=/pal; Secure; HttpOnly
      Content-Length:
      - '99'
      Content-Type:
      - application/x-www-form-urlencoded
    body:
      encoding: UTF-8
      string: modificationResult.pspReference=8515022349371928&modificationResult.response=%5Bcapture-received%5D
    http_version: 
  recorded_at: Tue, 08 Aug 2017 23:28:57 GMT
recorded_with: VCR 3.0.3
