spec/cassettes/Credit_Card_not_accepted.yml

---
http_interactions:
- request:
    method: post
    uri: https://<ADYEN_API_USERNAME>:<ADYEN_API_PASSWORD>@pal-test.adyen.com/pal/adapter/httppost
    body:
      encoding: US-ASCII
      string: paymentRequest.reference=R308079643&paymentRequest.merchantAccount=<ADYEN_MERCHANT_ACCOUNT>&paymentRequest.amount.value=2000&paymentRequest.amount.currency=USD&paymentRequest.shopperIP=&paymentRequest.shopperEmail=spree%40example.com&paymentRequest.shopperReference=1&paymentRequest.billingAddress.street=10+Lovely+Street&paymentRequest.billingAddress.houseNumberOrName=NA&paymentRequest.billingAddress.city=Herndon&paymentRequest.billingAddress.postalCode=79034-2999&paymentRequest.billingAddress.stateOrProvince=AL&paymentRequest.billingAddress.country=US&paymentRequest.additionalData.card.encrypted.json=adyenjs_0_1_18%24OPv4xmCNIuiAZSInTxQXKqARvJZq4ilHN7kek9W5wlAHyl%2BP9x74TiuHVzZOacO1%2BvN%2Bm%2FO1vZ%2FyUAzFtvz5Z%2Fg%2FO5nYpCpsHxTqmS5%2F5BJMLGxhpjkmNuus%2FGRvw0oQMF66cvFE9qEF6ypBPSdbhAM2hClFl%2BK%2BV55rWTdCl16jTVxyAlT5K3zLw72BWJrDeMnyWjVF1wnl%2FGvzeqRdqNC8Zt66bFu74kGKY6N7ij6XYqOSlq3%2Fq0bJzlPgz2mdkCbkDEZfXMO1T60m%2FRLT5Ac47ocUvnMtX%2B0dSiFt6F9oqSxnNN2Pwre5sZ6sZxxueIW8Nn09hgNDtPmg5ifhfA%3D%3D%24p3HO52iiTA44ni9OfnRj8pA0iH9sRFf0FZw4ds%2BP%2BZ1k4us4gPgciIW5VC31NqAMsF0X8aaevCDJacbT%2F5HbtgQz266RfmcQoV0MApgPHia%2FG2dW86lNaW0PcvaxY0HRxwH%2Fz4oNNlC34bEx%2BSyQs7OkYGBGF4CdLlEVS%2Bwexw6tOBTeuvsq%2F3H3YOwG616%2B8ZRunMh%2FGgBBGa8jFvQMfM2U3zoHIH22BVr428TEtyX1ER5bu2C4m45DSqhnAypmPhajM5Q8OCS8LmF0ivwmRjW29fpTj6MHq9LKrwSMJW3HkNSNMMMbP2qSgrlxjPxn01k0CwYhppubKpSXt439sX%2FkewbY16QbhgC5mJ1lB3mdRV9uHbKRnOHmtX0ygZ0m7LHffB%2BbGefGttkcq%2BQsGEBeI5aLbWDmt%2FWs9u2usFEj6Vs165N%2FWpyeUdnNOqqHP4tp6GDJiO%2BFbftGb5ph4mYBVJ09LuR%2BhSPtIgvmRCenEDcsMVgpZNayFmO1ZMtKqIfaDydmSrHYRTnwfg0XzsNcqX0kp1N00RH%2FWkkVQp8ILBIyl8o0MoDMITqohzw5%2BbvDidQI8n5XNshjGLpfe4ltb%2FrNBCFwTKuWyGIxXMC6TsIshnzaBflzKWDt5%2FcP0%2FibSgee2YC2XOS%2BWhR6TjinohM9yU86r1kxWHXtR6aQJZ0kIfIkpxYtejK9CqCzngJwW7nV50UOIygYPPqdwOYINrdVZ%2B9gugZBknf3%2Fmj9AbXs1rQAzx8ODWI58HUy92NGUchbkXQQuUkiefOldxRNLCHEudsEYLQlyiB%2BgmP6Z%2F2rhFTbvWDOX5xbhq5M4pJ0JXULxW8yT0%2B2QHOweYpg9%2BwpnmqRzvXFD5DolXqKK2Dgpaj3MQBwI6Mxpz%2BKLTVENJdk%2FRpApnBajz7tQ9PdZO8rf0z1WJnODbc8tvsY%2FerZ%2BD3tBVt9ju%2FqLDgLxFtI%2Bpi5fqf9uIrteUo8WjJoPjRLrFOJVUEpwRIaHMkDkthml7pwuX89StF7s9asfo1t2qnvmi5z4Kaih7vHaQqw2BSTW44My15fnnkTsJTtMe5%2BBUWAoW8IXVEQ2TVJbkMIr1tFsrrgcH0c91UjAvqrRanrSKh%2FhrPpBtS4rCqITY1c43s2vTadfg88JaSfp6oC%2FjreCV%2FHTvVomZhy00N76xhwN9NBwVubXtvvStFYElcFQb3wd6W6pBE%2Bq3EYDegKmw7HsJsYDD24tk1NVNRa2YvqaN%2BEUni5%2BFshiddOO1qDw%2F3CDFW0HROpz5RihM64mR%2BUOOWgkMiyJFDyjDGPeiESgk%2BiRsJrt%2FygI%2B%2Fo47kZBQzJHKa6YyZrooEDRBoyAw249vLLsjcbpbUf%2B0YEX%2BXkKC3IZMEWyMLfe5W1W3mBWM6yffBw3wQS9hN1ujFeECrb3Jo4PY0RGvjeSrl4G%2BhLK%2FA4tejnmWDBwnrZZ8XaFVVKt5iPBxAmQkMhUsGSsu6UZEUdrrCFTa5ymYw70GVA9rYG3t1xTst7jOwJOV2PlECnkhE%2F1AbGiNlk6YQdi8d4SDTMzQHvz08ZJX7n2TA9NiaLVw3o36Vc8MGGA2oqw259Oqy%2BYkDfhb%2Fu6MY7d0X%2FyhUb%2FqoDaAHLujY4xBCPpexEU4FjBZzGfV%2Bzs%2FwzGOAWMe0Bw2%2F8Sf%2FrBfkjX50pJjC27uh4FG9Gf77ZMPasP2dHlR5rC7aHEffyWRzdyU5inWafAVrk7eGTGUn4xFnvuq%2BiL%2FWn7WSiaV8djh4uIGLJ77ooQVbhl6QL86DOP2iz8HeWBaL9kYWiRB0PK4RXMA3oy0EBOrjCrf%2FhJjpJl%2BjD9lbkwDW8HK9FQKtBS2q3Wg3tojkebEiWwRJrhOpY4CyQfC%2F2zPDVRKw8oDqxlZ7iucWYjmCiQ1Iur%2BAVZohjjCga9sM8jiH8HSeE90MqpSG9J4RqT9tHVfbfIAalG7TpV0d79UKXxb9ibWaliQec7l8DwRei6nzEsKjHcbXT5lUSpKRnYZJ%2BdfNk82%2B6DX2bYUFO7kgmZvv8HLQmIVdCxHpYazv9w8NCB6Q2gG1yov9utvjaX1N6KNlvECLbC3z6S9epc6PlzEUIzWHC%2BBDZ03TGo7U0TGnHaT0xpMlDNmGg66hlghJ2gg9zS0P6BM7QyoVrGqol3xz6xniYNNXZGwBNxImOcGxuQaO4Xrhk%2BzmNr6X%2BFHOrmYbKjExnPjExAGx4554sptgo9nmLcezBpXnMhkjL17uYbYEqovnVRxwZmTfCeRCTI7QMRie1sLL9eXAl%2FopIa5kBM323FbVH1m9yPHblG5f7O2NbSn7otdUji7KwnsO%2FW%2B5QNmZw7pe3VW8OmSHN6In0pZ5%2BGqj6TzrG%2BRZSvVt3%2Fpn%2BvEmMg%2BEbtDhnlICp%2B6DQYsfXG25egRbL%2FSTZtI9tCZ4NpFT%2BAAhCL9vrM2xm34CPwNYKyWq8ccl8hpFCL70RvNDjTdvaCO6LSuhW7W%2F7YbvNNNz3YGye29kcG%2BLwgWVS8PXjB8ITFshC8CZOjB5210EMwy%2Fx0s8iP%2FOSNhE8ad%2FxQ2LaTSx1QmavDo4CIrvKAxDqSxkX993YVhg2Ka1j5PYJH3SuueA5OFIYHNFop9vOnRI0doXOZg0SQLQc5ZDVrjvMREV55yTVQfW5d50DlXk0HW6UbGVrFseFmCUV3KmlnHYtbNs6fIwnK8bX1xOHyqzzd4c%3D&paymentRequest.browserInfo.userAgent=Mozilla%2F5.0+%28Unknown%3B+Linux+x86_64%29+AppleWebKit%2F538.1+%28KHTML%2C+like+Gecko%29+PhantomJS%2F2.1.1+Safari%2F538.1&paymentRequest.browserInfo.acceptHeader=text%2Fhtml%2Capplication%2Fxhtml%2Bxml%2Capplication%2Fxml%3Bq%3D0.9%2C*%2F*%3Bq%3D0.8&paymentRequest.recurring.contract=RECURRING&action=Payment.authorise
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 08 Aug 2017 23:28:45 GMT
      Server:
      - Apache
      Set-Cookie:
      - JSESSIONID=85ED391357EA417EAF798C5DE5A042C3.test3e; Path=/pal; Secure; HttpOnly
      Content-Length:
      - '117'
      Content-Type:
      - application/x-www-form-urlencoded
    body:
      encoding: UTF-8
      string: paymentResult.resultCode=Refused&paymentResult.refusalReason=CVC+Declined&paymentResult.pspReference=8525022349251383
    http_version: 
  recorded_at: Tue, 08 Aug 2017 23:28:46 GMT
recorded_with: VCR 3.0.3
